# ShapeBuilder Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ShapeBuilder Properties
ShapeBuilder Class See Also
---
The ShapeBuilder type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ShapeBuilder Class
Autodesk.Revit.DB Namespace